{
	"metadata": {
		"name": "Sahih al-Bukhari",
		"section": {
			"1": "Mặc Khải"
		},
		"section_detail": {
			"1": {
				"hadithnumber_first": 1,
				"hadithnumber_last": 7,
				"arabicnumber_first": 1,
				"arabicnumber_last": 7
			}
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1,
			"arabicnumber": 1,
			"text": "Theo lời kể của 'Umar bin Al-Khattab (cầu xin Allah hài lòng về họ): Tôi đã nghe Thiên Sứ của Allah (ﷺ) nói: 'Quả thật, mọi hành động đều được định đoạt bởi ý định, và mỗi người sẽ nhận được thành quả tương ứng với những gì y đã chủ ý.\nVậy, ai có cuộc di cư (hijrah) vì những lợi ích thế tục muốn đạt được hay vì một người phụ nữ muốn cưới, thì cuộc di cư của y chỉ hướng đến những gì y đã chủ đích di cư đến mà thôi.'",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2,
			"arabicnumber": 2,
			"text": "Theo lời kể của 'Aisha (Mẹ của các tín đồ, cầu xin Allah hài lòng về họ): Al-Harith bin Hisham đã hỏi Thiên Sứ của Allah (ﷺ): 'Lạy Thiên Sứ của Allah! Mặc khải được ban xuống cho Người như thế nào?'\nThiên Sứ của Allah (ﷺ) trả lời: 'Đôi khi, nó đến với Ta như tiếng chuông ngân, và đó là hình thức nặng nề nhất đối với Ta, rồi trạng thái đó qua đi sau khi Ta đã ghi nhớ những gì được truyền đạt.\nĐôi khi, Thiên Thần hiện ra trong hình dạng một người đàn ông và nói chuyện với Ta, và Ta ghi nhớ mọi điều người ấy nói.'\n'Aisha nói thêm: 'Quả thật, tôi đã thấy Nabi (ﷺ) nhận mặc khải vào một ngày trời rất lạnh, và tôi nhận thấy mồ hôi chảy ròng ròng trên trán Người (khi mặc khải kết thúc).'",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3,
			"arabicnumber": 3,
			"text": "Theo lời kể của 'Aisha (Mẹ của các tín đồ, cầu xin Allah hài lòng về họ): 'Sự khởi đầu của Mặc Khải Thượng Đế đến với Thiên Sứ của Allah (ﷺ) là dưới dạng những giấc mơ đẹp và chúng trở thành sự thật rõ ràng như ánh sáng ban ngày.\nSau đó, tình yêu với sự ẩn dật được ban cho Người.\nNgười thường lui về ẩn dật trong hang Hira, nơi Người thờ phượng (một mình Allah) liên tục trong nhiều ngày trước khi có mong muốn gặp lại gia đình.\nNgười thường mang theo lương thực cho kỳ ở lại, sau đó trở về với (vợ mình là) Khadija để lấy thêm lương thực, cứ như vậy cho đến khi Chân Lý bất ngờ đến với Người khi Người đang ở trong hang Hira.\nThiên Thần đến gặp Người và yêu cầu Người đọc.\nNabi (ﷺ) trả lời: 'Ta không biết đọc.'\nNabi (ﷺ) nói thêm: 'Thiên Thần đã giữ lấy Ta (một cách mạnh mẽ) và ép Ta chặt đến mức Ta không thể chịu đựng được nữa.\nSau đó, người thả Ta ra và lại yêu cầu Ta đọc, và Ta trả lời: 'Ta không biết đọc.'\nNgười lại giữ lấy Ta lần thứ hai và ép Ta cho đến khi Ta không thể chịu đựng được nữa.\nRồi người thả Ta ra và lại yêu cầu Ta đọc, nhưng Ta vẫn trả lời: 'Ta không biết đọc (hoặc Ta phải đọc gì)?'\nNgười liền giữ lấy Ta lần thứ ba và ép Ta, sau đó thả Ta ra và nói: **'Hãy đọc nhân danh Thượng Đế của Ngươi, Đấng đã tạo ra (mọi thứ), Đấng đã tạo ra con người từ một cục máu đông.\nHãy đọc!\nVà Thượng Đế của Ngươi là Đấng Rộng Lượng Nhất.'** (Qur'an 96:1-3).\nSau đó, Thiên Sứ của Allah (ﷺ) trở về với Mặc Khải và trái tim Người đập rất mạnh.\nRồi Người đến gặp Khadija bint Khuwailid và nói: 'Đắp chăn cho Ta! Đắp chăn cho Ta!'\nHọ đắp chăn cho Người cho đến khi nỗi sợ của Người qua đi.\nSau đó, Người kể lại mọi chuyện đã xảy ra và nói: 'Ta sợ có điều gì đó sẽ xảy ra với Ta.'\nKhadija đáp: 'Không đời nào!\nThề với Allah, Allah sẽ không bao giờ hạ nhục Người.\nNgười luôn giữ mối quan hệ tốt đẹp với họ hàng thân thích, giúp đỡ người nghèo và người túng thiếu, phục vụ khách một cách hào phóng và giúp đỡ những người xứng đáng gặp hoạn nạn.'\nSau đó, Khadija cùng Người đến gặp người anh họ của bà là Waraqa bin Naufal bin Asad bin 'Abdul 'Uzza, người trong thời kỳ tiền Islam đã trở thành một tín đồ Kitô giáo và thường viết bằng chữ Hebrew.\nÔng thường chép lại từ Kinh Phúc Âm bằng tiếng Hebrew nhiều như Allah muốn ông viết.\nÔng là một người già và đã mất thị lực.\nKhadija nói với Waraqa: 'Lạy anh họ, xin hãy lắng nghe câu chuyện của cháu ngài!'\nWaraqa hỏi: 'Này cháu trai! Cháu đã thấy gì?'\nThiên Sứ của Allah (ﷺ) mô tả lại mọi điều Người đã thấy.\nWaraqa nói: 'Đây chính là người giữ những bí mật (Thiên Thần Jibril) mà Allah đã cử đến cho Musa.\nTa ước gì mình còn trẻ và có thể sống đến lúc dân của cháu sẽ đuổi cháu đi.'\nThiên Sứ của Allah (ﷺ) hỏi: 'Họ sẽ đuổi Ta đi sao?'\nWaraqa trả lời khẳng định và nói: 'Bất kỳ ai (người đàn ông nào) mang đến điều tương tự như những gì cháu mang đến đều bị đối xử thù địch; và nếu ta còn sống đến ngày cháu bị đuổi đi, ta chắc chắn sẽ ủng hộ cháu một cách mạnh mẽ.'\nNhưng vài ngày sau, Waraqa qua đời và Mặc Khải Thượng Đế cũng tạm dừng một thời gian.'",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4,
			"arabicnumber": 4,
			"text": "Theo lời kể của Jabir bin 'Abdullah Al-Ansari (trong khi nói về giai đoạn tạm dừng mặc khải), thuật lại lời của Nabi (ﷺ): 'Trong lúc Ta đang đi, đột nhiên Ta nghe một giọng nói từ trên trời.\nTa ngước nhìn lên và thấy chính Thiên Thần đã đến gặp Ta ở hang Hira đang ngồi trên một chiếc ghế giữa trời và đất.\nTa sợ hãi người ấy và trở về nhà nói: 'Trùm chăn cho tôi!'\nVà rồi Allah đã mặc khải những câu Kinh Thánh sau: **'Hỡi người (tức là Muhammad)!\ntrùm chăn!'\nHãy chỗi dậy và cảnh báo...\ncho đến 'và hãy tránh xa các thần tượng.'** (74:1-5).\nSau đó, mặc khải bắt đầu đến một cách mạnh mẽ, thường xuyên và đều đặn.'",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5,
			"arabicnumber": 5,
			"text": "Theo lời kể của Sa'id bin Jubair: Ibn 'Abbas trong lời giải thích về câu nói của Allah 'Ngươi chớ vội vàng cử động lưỡi của mình về (Qur'an).'\n(75:16) đã nói: 'Thiên Sứ của Allah (ﷺ) đã phải chịu đựng sự vất vả lớn khi nhận mặc khải và thường cử động đôi môi của mình (một cách nhanh chóng) theo Mặc Khải.'\nIbn 'Abbas cử động đôi môi và nói: 'Tôi đang cử động môi trước mặt quý vị như cách Thiên Sứ của Allah (ﷺ) đã cử động.'\nSa'id nói: 'Tôi đang cử động môi như tôi đã thấy Ibn 'Abbas cử động.'\nIbn 'Abbas nói thêm: 'Thế là Allah đã mặc khải: **'Ngươi chớ vội vàng cử động lưỡi của mình về (Qur'an).\nViệc thu thập nó và ban cho ngươi (hỡi Muhammad) khả năng đọc nó (Qur'an) là thuộc về TA.'** (75:16-17) có nghĩa là Allah sẽ làm cho Người (Nabi) ghi nhớ thuộc lòng và đọc được phần Qur'an đã được mặc khải vào lúc đó.\nLời phán của Allah: **'Và khi TA đã đọc nó cho ngươi (hỡi Muhammad, qua Jibril) thì ngươi hãy theo sau bài đọc (Qur'an) đó.'** (75:18) có nghĩa là 'hãy lắng nghe và im lặng.'\n**'Sau đó, việc làm rõ nó cho ngươi là thuộc về TA (Allah).'\n** (75:19) có nghĩa là 'Sau đó, (việc của Allah) là làm cho ngươi đọc nó (và ý nghĩa của nó sẽ tự nó rõ ràng qua lưỡi của ngươi).'\nSau đó, Thiên Sứ của Allah (ﷺ) thường lắng nghe Jibril mỗi khi người đến và sau khi người đi, Người thường đọc lại như Jibril đã đọc.'",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6,
			"arabicnumber": 6,
			"text": "Theo lời kể của Ibn 'Abbas: 'Thiên Sứ của Allah (ﷺ) là người hào phóng nhất trong tất cả mọi người, và Người đạt đến đỉnh cao của sự hào phóng trong tháng Ramadan khi Jibril gặp Người.\nJibril thường gặp Người mỗi đêm trong tháng Ramadan để dạy Người Kinh Qur'an.\nThiên Sứ của Allah (ﷺ) là người hào phóng nhất, thậm chí còn hào phóng hơn cả ngọn gió mạnh không thể kiểm soát (trong sự sẵn sàng và nhanh chóng làm việc thiện).'",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 6
			}
		},
{
	"hadithnumber": 7,
	"arabicnumber": 7,
	"text": "Theo lời kể của 'Abdullah bin 'Abbas: Abu Sufyan bin Harb đã thông báo cho tôi rằng Heraclius đã cử một sứ giả đến gặp ông trong khi ông đang đi cùng một đoàn lữ hành của bộ tộc Quraish. Họ là những thương nhân đang kinh doanh ở Sham (Syria, Palestine, Lebanon và Jordan), vào thời điểm mà Thiên Sứ của Allah (ﷺ) có thỏa thuận ngừng chiến với Abu Sufyan và những người ngoại đạo Quraish. Do đó, Abu Sufyan và những người bạn đồng hành của mình đã đến gặp Heraclius tại Ilya (Jerusalem). Heraclius triệu họ vào triều đình và xung quanh ông là tất cả các chức sắc cao cấp của La Mã. Ông cho gọi thông dịch viên của mình, người này dịch câu hỏi của Heraclius và nói với họ: 'Trong số các vị, ai có quan hệ họ hàng gần nhất với người đàn ông tự xưng là một Nabi?' Abu Sufyan trả lời: 'Tôi là người có họ hàng gần nhất với ông ta (trong nhóm).' Heraclius nói: 'Hãy đưa ông ta (Abu Sufyan) đến gần tôi và để các bạn đồng hành của ông ta đứng sau lưng.' Abu Sufyan nói thêm, Heraclius bảo thông dịch viên của mình nói với các bạn đồng hành của tôi rằng ông ta muốn hỏi tôi một số câu về người đàn ông đó (Nabi) và nếu tôi nói dối, họ (bạn đồng hành của tôi) nên phản bác tôi. Abu Sufyan nói thêm: 'Thề với Allah! Nếu tôi không sợ các bạn đồng hành của mình sẽ gán cho tôi là kẻ nói dối, tôi đã không nói sự thật về Nabi. Câu hỏi đầu tiên ông ta hỏi tôi về Người là: 'Địa vị gia đình của ông ta trong số các vị như thế nào?' Tôi trả lời: 'Ông ta thuộc một gia đình tốt (quý tộc) trong số chúng tôi.' Heraclius hỏi tiếp: 'Có ai trong số các vị đã từng tuyên bố điều tương tự (tức là làm một Nabi) trước ông ta không?' Tôi trả lời: 'Không.' Ông ta nói: 'Có ai trong số tổ tiên của ông ta là vua không?' Tôi trả lời: 'Không.' Heraclius hỏi: 'Giới quý tộc hay người nghèo theo ông ta?' Tôi trả lời: 'Chính là người nghèo theo ông ta.' Ông ta nói: 'Những người theo ông ta đang tăng lên hay giảm đi (từng ngày)?' Tôi trả lời: 'Họ đang tăng lên.' Sau đó, ông ta hỏi: 'Có ai trong số những người theo tôn giáo của ông ta trở nên không hài lòng và từ bỏ tôn giáo sau đó không?' Tôi trả lời: 'Không.' Heraclius nói: 'Các vị có bao giờ buộc tội ông ta nói dối trước khi ông ta tuyên bố (làm một Nabi) không?' Tôi trả lời: 'Không.' Heraclius nói: 'Ông ta có phá vỡ lời hứa của mình không?' Tôi trả lời: 'Không. Chúng tôi đang trong thời gian hưu chiến với ông ta nhưng chúng tôi không biết ông ta sẽ làm gì trong đó.' Tôi không thể tìm thấy cơ hội nào để nói điều gì chống lại ông ta ngoại trừ câu đó. Heraclius hỏi: 'Các vị có bao giờ chiến tranh với ông ta không?' Tôi trả lời: 'Có.' Sau đó ông ta nói: 'Kết quả của các trận chiến là gì?' Tôi trả lời: 'Đôi khi ông ta chiến thắng và đôi khi là chúng tôi.' Heraclius nói: 'Ông ta ra lệnh cho các vị làm gì?' Tôi nói: 'Ông ta bảo chúng tôi thờ phượng một mình Allah và chỉ một mình Allah thôi, và không thờ phượng bất cứ thứ gì cùng với Ngài, và từ bỏ tất cả những gì tổ tiên chúng tôi đã nói. Ông ta ra lệnh cho chúng tôi cầu nguyện, nói sự thật, sống trong sạch và giữ mối quan hệ tốt đẹp với họ hàng thân thích.' Heraclius yêu cầu thông dịch viên truyền đạt lại cho tôi những điều sau: 'Ta đã hỏi ngươi về gia đình của ông ta và câu trả lời của ngươi là ông ta thuộc một gia đình rất cao quý. Thực tế, tất cả các Sứ Giả đều xuất thân từ các gia đình cao quý trong dân tộc của họ. Ta đã hỏi ngươi liệu có ai khác trong số các ngươi đã tuyên bố điều tương tự không, câu trả lời của ngươi là không. Nếu câu trả lời là có, ta sẽ nghĩ rằng người đàn ông này đang lặp lại lời tuyên bố của người đi trước. Sau đó, ta hỏi ngươi liệu có ai trong số tổ tiên của ông ta là vua không. Câu trả lời của ngươi là không, và nếu là có, ta sẽ nghĩ rằng người đàn ông này muốn lấy lại vương quốc của tổ tiên mình. Ta hỏi thêm liệu ông ta có bao giờ bị buộc tội nói dối trước khi nói những gì ông ta đã nói không, và câu trả lời của ngươi là không. Vì vậy, ta tự hỏi làm sao một người không nói dối về người khác lại có thể nói dối về Allah. Sau đó, ta hỏi ngươi liệu người giàu hay người nghèo theo ông ta. Ngươi trả lời rằng chính người nghèo theo ông ta. Và thực tế, tất cả các Sứ Giả đều được tầng lớp người này theo sau. Sau đó, ta hỏi ngươi liệu những người theo ông ta đang tăng lên hay giảm đi. Ngươi trả lời rằng họ đang tăng lên, và thực tế đây là con đường của đức tin chân chính, cho đến khi nó hoàn thiện về mọi mặt. Ta hỏi thêm ngươi liệu có ai, sau khi theo tôn giáo của ông ta, trở nên không hài lòng và từ bỏ tôn giáo của mình không. Câu trả lời của ngươi là không, và thực tế đây là (dấu hiệu của) đức tin chân chính, khi niềm vui của nó đi vào trái tim và hòa quyện hoàn toàn với chúng. Ta hỏi ngươi liệu ông ta có bao giờ phản bội không. Ngươi trả lời không và tương tự như vậy, các Sứ Giả không bao giờ phản bội. Sau đó, ta hỏi ngươi ông ta ra lệnh cho các ngươi làm gì. Ngươi trả lời rằng ông ta ra lệnh cho các ngươi thờ phượng một mình Allah và không thờ phượng bất cứ thứ gì cùng với Ngài và cấm các ngươi thờ cúng các thần tượng và ra lệnh cho các ngươi cầu nguyện, nói sự thật và sống trong sạch. Nếu những gì ngươi đã nói là sự thật, ông ta sẽ sớm chiếm lĩnh nơi này dưới chân ta và ta đã biết (từ kinh sách) rằng ông ta sẽ xuất hiện nhưng ta không nghĩ rằng ông ta sẽ từ trong các ngươi, và nếu ta có thể đến được với ông ta một cách chắc chắn, ta sẽ ngay lập tức đi gặp ông ta và nếu ta ở cùng ông ta, ta chắc chắn sẽ rửa chân cho ông ta.' Sau đó, Heraclius yêu cầu mang đến bức thư của Thiên Sứ của Allah mà Dihya đã giao cho Thống đốc Busra, người đã chuyển nó cho Heraclius đọc. Nội dung của bức thư như sau: 'Nhân danh Allah, Đấng Rất Mực Khoan Dung, Đấng Rất Mực Độ Lượng. (Bức thư này) từ Muhammad, người nô lệ của Allah và Sứ Giả của Ngài gửi đến Heraclius, người cai trị của Byzantine. Bình an cho người đi theo con đường đúng đắn. Hơn nữa, ta mời ngươi đến với Islam, và nếu ngươi trở thành một người Muslim, ngươi sẽ được an toàn, và Allah sẽ nhân đôi phần thưởng cho ngươi, và nếu ngươi từ chối lời mời này của Islam, ngươi sẽ mang tội lỗi của những người Arisiyin (nông dân, tức là dân của ngươi). Và (Lời phán của Allah): **'Hỡi người dân của Kinh Sách! Hãy đến với một lời nói chung cho chúng tôi và các người rằng chúng ta không thờ phượng ai ngoài Allah và không liên kết bất cứ điều gì trong việc thờ phượng với Ngài, và không ai trong chúng ta sẽ coi người khác là chúa tể bên cạnh Allah. Sau đó, nếu họ quay lưng, hãy nói: Hãy làm chứng rằng chúng tôi là những người Muslim (những người đã quy phục Allah).'** (3:64).' Abu Sufyan sau đó nói thêm: 'Khi Heraclius kết thúc bài phát biểu của mình và đọc xong bức thư, đã có một sự huyên náo lớn trong Hoàng cung. Vì vậy, chúng tôi đã bị đưa ra khỏi triều đình. Tôi nói với các bạn đồng hành của mình rằng vấn đề của Ibn-Abi-Kabsha (Nabi Muhammad ﷺ) đã trở nên nổi bật đến mức ngay cả Vua của Bani Al-Asfar (Byzantine) cũng sợ ông ta. Sau đó, tôi bắt đầu tin chắc rằng ông ta (Nabi) sẽ là người chiến thắng trong tương lai gần cho đến khi tôi theo Islam (tức là Allah đã hướng dẫn tôi đến với nó).' Người kể phụ nói thêm: 'Ibn An-Natur là Thống đốc của Ilya' (Jerusalem) và Heraclius là người đứng đầu các tín đồ Kitô giáo của Sham. Ibn An-Natur kể rằng một lần khi Heraclius đang thăm Ilya' (Jerusalem), ông ta thức dậy vào buổi sáng với tâm trạng buồn bã. Một số linh mục của ông ta hỏi tại sao ông ta lại có tâm trạng đó. Heraclius là một nhà tiên tri và một nhà chiêm tinh. Ông ta trả lời: 'Đêm qua khi ta nhìn các vì sao, ta thấy rằng người lãnh đạo của những người thực hành cắt bao quy đầu đã xuất hiện (trở thành người chiến thắng). Ai là những người thực hành cắt bao quy đầu?' Mọi người trả lời: 'Ngoại trừ người Do Thái, không ai thực hành cắt bao quy đầu, vì vậy ngài không nên sợ họ (người Do Thái). 'Chỉ cần ra lệnh giết mọi người Do Thái có mặt trong nước.' Trong khi họ đang thảo luận, một sứ giả do vua Ghassan cử đến để truyền tin về Thiên Sứ của Allah (ﷺ) cho Heraclius đã được đưa vào. Sau khi nghe tin, ông ta (Heraclius) ra lệnh cho mọi người đi xem liệu sứ giả của Ghassan có được cắt bao quy đầu không. Mọi người, sau khi xem xét, nói với Heraclius rằng anh ta đã được cắt bao quy đầu. Heraclius sau đó hỏi anh ta về người Ả Rập. Sứ giả trả lời: 'Người Ả Rập cũng thực hành cắt bao quy đầu.' (Sau khi nghe điều đó) Heraclius nhận xét: 'Vị vua của dân tộc này đã xuất hiện.' Sau đó, Heraclius viết một lá thư cho một người bạn của mình ở Rome, người có kiến thức ngang với Heraclius. Heraclius sau đó rời đi Homs (một thị trấn ở Syria) và ở đó cho đến khi nhận được thư trả lời từ người bạn của mình, người đồng ý với ông về sự xuất hiện của Nabi (ﷺ) và thực tế rằng Người là một Nabi. Về điều đó, Heraclius đã mời tất cả các vị đứng đầu của Byzantine tập trung tại cung điện của mình ở Homs. Khi họ tập trung, ông ra lệnh đóng tất cả các cửa của cung điện. Sau đó, ông bước ra và nói: 'Hỡi những người Byzantine! Nếu thành công là mong muốn của các vị và nếu các vị tìm kiếm sự hướng dẫn đúng đắn và muốn đế chế của mình tồn tại, thì hãy thề trung thành với Nabi này (tức là theo Islam).' (Khi nghe quan điểm của Heraclius) mọi người chạy về phía các cánh cửa của cung điện như những con lừa hoang nhưng thấy các cánh cửa đã bị đóng. Heraclius nhận ra sự căm ghét của họ đối với Islam và khi ông mất hy vọng về việc họ sẽ theo Islam, ông ra lệnh đưa họ trở lại. (Khi họ trở lại) ông nói: 'Những gì ta đã nói trước đó chỉ là để thử thách sức mạnh niềm tin của các vị và ta đã thấy nó.' Mọi người quỳ lạy trước ông và hài lòng với ông, và đây là kết thúc câu chuyện của Heraclius (liên quan đến đức tin của ông).'",
	"grades": [],
	"reference": {
		"book": 1,
		"hadith": 7
	}
}
	]
}
